Revit 2027 API
RebarShapeDefinition.Complete Property
 Report whether the shape definition is fully constrained.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Complete { get; }
Public ReadOnly Property Complete As Boolean
	Get
public:
property bool Complete {
	bool get ();
}
member Complete : bool with get
Property Value
Boolean
See Also
Reference
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace